Tekla Open API Reference for Tekla Structures 2025
PreferredSymbolPlacingTypes Class
 The PreferredSymbolPlacingTypes class contains the available preferred symbol placing types. These are allowed to be used for symbols.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredSymbolPlacingTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class PreferredSymbolPlacingTypes
Public NotInheritable Class PreferredSymbolPlacingTypes
The PreferredSymbolPlacingTypes type exposes the following members.
Methods
Name | Description
AlongLinePlacingType
 The object is placed using the along line placing.
LeaderLinePlacingType
 The object is placed with a leader line.
PointPlacingType
 The object is placed at one point (the insertion point) without any additional placing options.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace